Revit 2027 API
FabricationConfiguration.GetSpecificationByGUID Method
 Gets the specification identifier by its GUID.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetSpecificationByGUID(
	Guid specificationGUID
)
Public Function GetSpecificationByGUID (
	specificationGUID As Guid
) As Integer
public:
int GetSpecificationByGUID(
	Guid specificationGUID
)
member GetSpecificationByGUID :
        specificationGUID : Guid -> int
Parameters
specificationGUID Guid
 The specification GUID.
Return Value
Int32
 The specification identifier. Returns 0 if not found.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace